Revit 2026 API

# UIApplicationCreateRibbonTab Method

---

Creates a new tab on the Revit user interface.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual void CreateRibbonTab(
	string tabName
)
```
```vb
Public Overridable Sub CreateRibbonTab (
	tabName As String
)
```
```cpp
public:
virtual void CreateRibbonTab(
	String^ tabName
)
```
```fsharp
abstract CreateRibbonTab :
        tabName : string -> unit
override CreateRibbonTab :
        tabName : string -> unit
```

#### Parameters

tabName String
    The name of the tab to be created.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | tabName or panelName is . |
| ArgumentException | tabName or panelName is Empty or the tab name duplicates the name of another tab in the Revit UI. |
| InvalidOperationException | Too many custom tabs have been created in this session. (Maximum is 20). |

This method will create a custom tab at the end of the list of static tabs. If multiple tabs are added, they will be shown in the order added. This method is not supported in Macros.

#### Reference

UIApplication Class

Autodesk.Revit.UI Namespace